Revit 2026 API

# PrintManagerPrintSetup Property

---

The PrintSetup which manages the print settings of current document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PrintSetup PrintSetup { get; }
```
```vb
Public ReadOnly Property PrintSetup As PrintSetup
	Get
```
```cpp
public:
property PrintSetup^ PrintSetup {
	PrintSetup^ get ();
}
```
```fsharp
member PrintSetup : PrintSetup with get
```

#### Property Value

PrintSetup

PrintSetup is an interface cluster just like File->Print->Settings->Setup or File->Print Setup in UI.

#### Reference

PrintManager Class

Autodesk.Revit.DB Namespace